app/controllers/application_controller.rb

  def logged_in_user
    if decoded_token
      user_id = decoded_token[0]['user_id']
      @user = Auth.find_by(id: user_id)
---
SELECT "auths".* FROM "auths" WHERE "auths"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]