app/controllers/auths_controller.rb

    def login
        @user = Auth.find_by(email: params[:email])

        if @user && @user.authenticate(params[:password])
            token = encode_token({user_id: @user.id})
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: @user[:userid],
                action: "User logged in"
            })
---
SELECT "auths".* FROM "auths" WHERE "auths"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "auths" ("email", "password_digest", "role", "created_at", "updated_at", "name", "userid") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"

    def add_user(role)
        struct = auth_params.merge({ userid: SecureRandom.uuid })
        if struct[:role] != role
            Log.create({
                log_id: SecureRandom.uuid,
                action: "User failed to register"
            })
            render json: {
                error: "Invalid argument"
            }, status: 400

        else
            @user = Auth.create(struct)
            if @user.valid?
                token = encode_token({ user_id: @user.id })
                Log.create({
                    log_id: SecureRandom.uuid,
                    user_id: struct[:userid],
                    action: "User registered",
                    client_id: role == "client" ? struct[:userid] : nil
                })
---
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
INSERT INTO "auths" ("email", "password_digest", "role", "created_at", "updated_at", "name", "userid") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"