app/controllers/auths_controller.rb

    def add_admin
        if auth_params[:role] != "admin"
            render json: {error: "Invalid argument"}
            return
        end

        @user = Auth.create(auth_params)
---
INSERT INTO "auths" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["role", "client"], ["created_at", "2024-07-31 13:03:36.405123"], ["updated_at", "2024-07-31 13:03:36.405123"]]

    def create_client
        if auth_params[:role] != "client"
            render json: {error: "Invalid argument"}
            return
        end

        @user = Auth.create(auth_params)
---
INSERT INTO "auths" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["role", "client"], ["created_at", "2024-07-31 17:28:00.689878"], ["updated_at", "2024-07-31 17:28:00.689878"]]

    def login
        @user = Auth.find_by(email: params[:email])
---
SELECT "auths".* FROM "auths" WHERE "auths"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]