app/controllers/brand_ownerships_controller.rb

INSERT INTO "brand_ownerships" ("brand_id", "product_id", "conn_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "conn_id"
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def add_product_to_brand
        struct = brand_ownership_params.merge({ conn_id: SecureRandom.uuid })
        @brand_ownership = BrandOwnership.create(struct)

        if @brand_ownership.valid?
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Add product to brand",
                product_id: struct[:product_id],
                brand_id: struct[:brand_id]
            })

SELECT "brand_ownerships".* FROM "brand_ownerships" WHERE "brand_ownerships"."conn_id" = $1 LIMIT $2  [["conn_id", "7480c088-db54-4ba1-86aa-6289107fb971"], ["LIMIT", 1]]
DELETE FROM "brand_ownerships" WHERE "brand_ownerships"."conn_id" = $1  [["conn_id", "7480c088-db54-4ba1-86aa-6289107fb971"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def remove_product_from_brand
        @brand_ownership = BrandOwnership.find(brand_ownership_params[:conn_id])

        @brand_ownership.destroy

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Remove product from brand",
            product_id: @brand_ownership[:product_id],
            brand_id: @brand_ownership[:brand_id]
        })