app/controllers/brands_controller.rb

    def register
        struct = brand_params.merge({ brand_id: SecureRandom.uuid })
        @brand = Brand.create(struct)

        if @brand.valid?
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Register brand",
                brand_id: struct[:brand_id]
            })
---
INSERT INTO "brands" ("name", "state", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "brand_id"  [["name", "TARDIS"], ["state", "active"], ["brand_id", "2813216b-059b-404a-ba90-2168770020dc"], ["created_at", "2024-08-01 20:32:17.490336"], ["updated_at", "2024-08-01 20:32:17.490336"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"

    def update_brand
        @brand = Brand.find(brand_params[:brand_id])

        if @brand.update(brand_params)
            @brand.reload
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Update brand",
                brand_id: @brand[:brand_id]
            })
            render json: {
                brand: @brand
            }, status: 200
        else
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Failed to update brand",
                brand_id: @brand[:brand_id]
            })
---
SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "597703b2-370c-4fcc-9da7-254d8aec9bd4"], ["LIMIT", 1]]
UPDATE "brands" SET "state" = $1, "updated_at" = $2 WHERE "brands"."brand_id" = $3  [["state", "active"], ["updated_at", "2024-08-01 21:09:43.961759"], ["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"