app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "55a5978a-edb8-44b5-8081-60e1cf544fb3"], ["LIMIT", 1]]
UPDATE "brands" SET "state" = $1, "updated_at" = $2 WHERE "brands"."brand_id" = $3  [["state", "inactive"], ["updated_at", "2024-08-01 12:54:12.838709"], ["brand_id", "55a5978a-edb8-44b5-8081-60e1cf544fb3"]]
---
    def update_brand
        @brand = Brand.find(brand_params[:brand_id])
        if @brand.valid?
            @brand.update(brand_params)