app/controllers/cards_controller.rb

    def cancel
        @card = Card.find(card_params[:card_id])

        if @card[:client_id] != get_current_user_id
            render json: {
                message: "Unauthorized"
            }, status: 401
        else
            @card.destroy
---
SELECT "cards".* FROM "cards" WHERE "cards"."card_id" = $1 LIMIT $2  [["card_id", "9453531d-9da7-4f28-81db-a2b7c03aa665"], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."card_id" = $1  [["card_id", "9453531d-9da7-4f28-81db-a2b7c03aa665"]]

    def get_all_cards
        @all_cards = Card.all.where(client_id: get_current_user_id)
---
SELECT "cards".* FROM "cards" WHERE "cards"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]

    def format_card(card)
        @brand_ownership = BrandOwnership.find(card[:prod_id])
        @brand = Brand.find(@brand_ownership[:brand_id])
        @product = Product.find(@brand_ownership[:product_id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "8a2f6c56-ea3b-4197-a23e-ea3a93ebb846"], ["LIMIT", 1]]