app/controllers/cards_controller.rb

    def request_card
        @pin = rand.to_s[2..7] if card_params[:pin_requested]

        @card = Card.create(card_params.slice(:prod_id).merge({
            card_id: SecureRandom.uuid,
            card_number: rand.to_s[2..19],
            activation_number: SecureRandom.hex,
            client_id: get_current_user_id,
            pin: @pin
        }))

        if @card.valid?
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Card request",
                client_id: get_current_user_id,
                card_id: @card[:card_id]
            })
---
INSERT INTO "cards" ("card_id", "card_number", "client_id", "activation_number", "pin", "prod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "card_id"
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"

    def cancel
        @card = Card.find(card_params[:card_id])

        if @card[:client_id] != get_current_user_id
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Failed to cancel card: unauthorized",
                client_id: get_current_user_id,
                card_id: @card[:card_id]
            })
            render json: {
                message: "Unauthorized"
            }, status: 401
        else
            @card.destroy
---
SELECT "cards".* FROM "cards" WHERE "cards"."card_id" = $1 LIMIT $2  [["card_id", "decaf8dd-2010-485a-a345-bbb035744a59"], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."card_id" = $1  [["card_id", "decaf8dd-2010-485a-a345-bbb035744a59"]]

    def get_all_cards
        @all_cards = Card.all.where(client_id: get_current_user_id)
        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Card list request",
            client_id: get_current_user_id
        })
        render json: {
            all_cards: @all_cards.map { |card| format_card(card) }
---
SELECT "cards".* FROM "cards" WHERE "cards"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"

    def use
        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Card use",
            client_id: get_current_user_id,
            card_id: card_params[:card_id]
        })
---
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"

    def format_card(card)
        @brand_ownership = BrandOwnership.find(card[:prod_id])
        @brand = Brand.find(@brand_ownership[:brand_id])
        @product = Product.find(@brand_ownership[:product_id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "8a2f6c56-ea3b-4197-a23e-ea3a93ebb846"], ["LIMIT", 1]]