app/controllers/client_catalogs_controller.rb

SELECT "client_products".* FROM "client_products" WHERE "client_products"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "8a2f6c56-ea3b-4197-a23e-ea3a93ebb846"], ["LIMIT", 1]]
---
    def get_all
        @all_products = ClientProduct.all.where(client_id: get_current_user_id)

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Client viewed all products",
            client_id: get_current_user_id
        })

        render json: {
            all_products: @all_products.map { |prod| format_product(prod) }

SELECT "client_products".* FROM "client_products" WHERE "client_products"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "8a2f6c56-ea3b-4197-a23e-ea3a93ebb846"], ["LIMIT", 1]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def get_by_product_id
        if !catalog_params[:product_id]
            render json: {
                error: "Invalid argument"
            }, status: 400
            return
        end

        @all_products = ClientProduct.all.where(client_id: get_current_user_id).map { |prod| format_product(prod) }
        @matching_products = @all_products.select{ |product| product[:product][:product_id] == catalog_params[:product_id] }

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Client viewed all products by product",
            product_id: catalog_params[:product_id],
            client_id: get_current_user_id
        })

SELECT "client_products".* FROM "client_products" WHERE "client_products"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]
SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "8a2f6c56-ea3b-4197-a23e-ea3a93ebb846"], ["LIMIT", 1]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def get_by_brand_id
        if !catalog_params[:brand_id]
            render json: {
                error: "Invalid argument"
            }, status: 400
            return
        end

        @all_products = ClientProduct.all.where(client_id: get_current_user_id).map { |prod| format_product(prod) }
        @matching_products = @all_products.select{ |product| product[:brand][:brand_id] == catalog_params[:brand_id] }

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Client viewed all products by brand",
            brand_id: catalog_params[:brand_id],
            client_id: get_current_user_id
        })

SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "8a2f6c56-ea3b-4197-a23e-ea3a93ebb846"], ["LIMIT", 1]]
---
    def format_product(client_product)
        @brand_ownership = BrandOwnership.find(client_product[:prod_id])
        @brand = Brand.find(@brand_ownership[:brand_id])
        @product = Product.find(@brand_ownership[:product_id])