app/controllers/client_products_controller.rb

SELECT "client_products".* FROM "client_products" WHERE "client_products"."conn_id" = $1 LIMIT $2  [["conn_id", "d12cfc36-270e-47e0-90bc-315e8096dfb1"], ["LIMIT", 1]]
DELETE FROM "client_products" WHERE "client_products"."conn_id" = $1  [["conn_id", "d12cfc36-270e-47e0-90bc-315e8096dfb1"]]
---
    def remove_product_from_client
        @client_product = ClientProduct.find(client_product_params[:conn_id])

        @client_product.destroy

UPDATE "client_products" SET "payout_rate" = $1, "updated_at" = $2 WHERE "client_products"."conn_id" = $3  [["payout_rate", 5.23], ["updated_at", "2024-08-01 13:51:26.883951"], ["conn_id", "077b3a08-8ffe-4308-8281-56c1d714c128"]]
---
    def set_payout_rate
        if !client_product_params[:conn_id]
            render json: {
                error: "Could not find client product"
            }, status: 400
        else
            @client_product = ClientProduct.find(client_product_params[:conn_id])
            if @client_product[:payout_rate] != client_product_params[:payout_rate] &&
                (@client_product[:client_id] == client_product_params[:client_id] || !client_product_params[:client_id]) &&
                (@client_product[:prod_id] == client_product_params[:prod_id] || !client_product_params[:prod_id]) &&
                (@client_product[:state] == client_product_params[:state] || !client_product_params[:state])
                @client_product.update(client_product_params)