app/controllers/client_catalogs_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"], ["LIMIT", 1]]
---
    def get_by_brand_id
        if !catalog_params[:brand_id]
            render json: { error: "Invalid argument" }
            return
        end

        @all_products = ClientProduct.all.where(client_id: catalog_params[:client_id]).map { |prod| format_product(prod) }
        @matching_products = @all_products.select{ |product| product[:brand][:brand_id] == catalog_params[:brand_id] }