app/controllers/client_products_controller.rb

INSERT INTO "client_products" ("state", "prod_id", "payout_rate", "client_id", "conn_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "conn_id"
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def add_product_to_client
        struct = client_product_params.merge({ conn_id: SecureRandom.uuid })
        @client_product = ClientProduct.create(struct)

        if @client_product.valid?
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Added product to client",
                client_id: struct[:client_id],
                product_id: struct[:product_id]
            })

            render json: {
                client_product: @client_product
            }, status: 200
        else
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Failed to add product to client",
                client_id: struct[:client_id],
                product_id: struct[:product_id]
            })

SELECT "client_products".* FROM "client_products" WHERE "client_products"."conn_id" = $1 LIMIT $2  [["conn_id", "76228b7d-2a8e-4a03-a440-3ec2fda0cec6"], ["LIMIT", 1]]
DELETE FROM "client_products" WHERE "client_products"."conn_id" = $1  [["conn_id", "76228b7d-2a8e-4a03-a440-3ec2fda0cec6"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def remove_product_from_client
        @client_product = ClientProduct.find(client_product_params[:conn_id])

        @client_product.destroy
        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Removed product from client",
            client_id: @client_product[:client_id],
            product_id: @client_product[:product_id]
        })

SELECT "client_products".* FROM "client_products" WHERE "client_products"."conn_id" = $1 LIMIT $2  [["conn_id", "97f7fb8e-2488-4d29-bdac-16ceb4ae44c7"], ["LIMIT", 1]]
UPDATE "client_products" SET "state" = $1, "updated_at" = $2 WHERE "client_products"."conn_id" = $3  [["state", "inactive"], ["updated_at", "2024-08-01 13:53:04.813756"], ["conn_id", "077b3a08-8ffe-4308-8281-56c1d714c128"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def set_payout_rate
        if !client_product_params[:conn_id]
            render json: {
                error: "Could not find client product"
            }, status: 400
        else
            @client_product = ClientProduct.find(client_product_params[:conn_id])
            if @client_product[:payout_rate] != client_product_params[:payout_rate] &&
                (@client_product[:client_id] == client_product_params[:client_id] || !client_product_params[:client_id]) &&
                (@client_product[:prod_id] == client_product_params[:prod_id] || !client_product_params[:prod_id]) &&
                (@client_product[:state] == client_product_params[:state] || !client_product_params[:state]) &&
                @client_product.update(client_product_params)

                @client_product.reload

                Log.create({
                    log_id: SecureRandom.uuid,
                    user_id: get_current_user_id,
                    action: "Updated product for client",
                    client_id: @client_product[:client_id],
                    product_id: @client_product[:product_id]
                })
                render json: {
                    client_product: @client_product
                }, status: 200
            else
                Log.create({
                    log_id: SecureRandom.uuid,
                    user_id: get_current_user_id,
                    action: "Failed to update product for client",
                    client_id: @client_product[:client_id],
                    product_id: @client_product[:product_id]
                })

SELECT "client_products".* FROM "client_products" WHERE "client_products"."conn_id" = $1 LIMIT $2  [["conn_id", "97f7fb8e-2488-4d29-bdac-16ceb4ae44c7"], ["LIMIT", 1]]
UPDATE "client_products" SET "state" = $1, "updated_at" = $2 WHERE "client_products"."conn_id" = $3  [["state", "inactive"], ["updated_at", "2024-08-01 20:49:24.485476"], ["conn_id", "97f7fb8e-2488-4d29-bdac-16ceb4ae44c7"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def set_state
        if !client_product_params[:conn_id]
            render json: {
                error: "Could not find client product"
            }, status: 400
        else
            @client_product = ClientProduct.find(client_product_params[:conn_id])
            if @client_product[:state] != client_product_params[:state] &&
                (@client_product[:client_id] == client_product_params[:client_id] || !client_product_params[:client_id]) &&
                (@client_product[:prod_id] == client_product_params[:prod_id] || !client_product_params[:prod_id]) &&
                (@client_product[:payout_rate] == client_product_params[:payout_rate] || !client_product_params[:payout_rate]) &&
                @client_product.update(client_product_params)

                @client_product.reload

                Log.create({
                    log_id: SecureRandom.uuid,
                    user_id: get_current_user_id,
                    action: "Updated product for client",
                    client_id: @client_product[:client_id],
                    product_id: @client_product[:product_id]
                })