app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs" WHERE "logs"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def generate_client_operations_report
        @all_logs_for_client = Log.where(client_id: get_current_user_id)

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Client operations report generated",
            client_id: get_current_user_id
        })

        render json: {
            client_operations_log: @all_logs_for_client.map{ |entry| format_log_entry(entry) }

INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
SELECT "logs".* FROM "logs" WHERE "logs"."brand_id" = $1  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"]]
---
    def generate_brand_operations
        @brand_logs = Log.where(brand_id: log_params[:brand_id])

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Brand operations report generated"
        })

        render json: {
            brand_operations_log: @brand_logs.map{ |entry| format_log_entry(entry) }

SELECT "logs".* FROM "logs" WHERE "logs"."client_id" = $1  [["client_id", "900f4d84-c6db-4294-9219-4481ebe3e408"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"
---
    def generate_client_operations
        @client_logs = Log.where(client_id: log_params[:client_id])

        Log.create({
            log_id: SecureRandom.uuid,
            user_id: get_current_user_id,
            action: "Brand operations report generated",
            client_id: log_params[:client_id]
        })

        render json: {
            client_operations_log: @client_logs.map{ |entry| format_log_entry(entry) }

SELECT "auths".* FROM "auths" WHERE "auths"."userid" = $1 LIMIT $2  [["userid", "7bac3a09-79d0-4a58-933a-9597f3475da3"], ["LIMIT", 1]]
SELECT "brands".* FROM "brands" WHERE "brands"."brand_id" = $1 LIMIT $2  [["brand_id", "6fe75651-dbae-43b1-9c31-21767d65e3fe"], ["LIMIT", 1]]
---
    def format_name(id, type)
        if !id || id.length == 0
            return ""
        else
            object = nil
            case type
                when "user"
                    object = Auth.find_by(userid: id)
                when "brand"
                    object = Brand.find_by(brand_id: id)