app/controllers/products_controller.rb

    def register
        struct = product_params.merge({ product_id: SecureRandom.uuid })
        @product = Product.create(struct)

        if @product.valid?
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Created product",
                product_id: struct[:product_id]
            })
---
INSERT INTO "products" ("name", "description", "state", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "product_id"
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"

    def update_product
        @product = Product.find(product_params[:product_id])

        if @product.update(product_params)
            @product.reload
            Log.create({
                log_id: SecureRandom.uuid,
                user_id: get_current_user_id,
                action: "Updated product",
                product_id: @product[:product_id]
            })
---
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "479cba11-8292-4453-b3bc-b521eeb4eb9a"], ["LIMIT", 1]]
UPDATE "products" SET "state" = $1, "updated_at" = $2 WHERE "products"."product_id" = $3  [["state", "inactive"], ["updated_at", "2024-08-01 20:37:02.156419"], ["product_id", "479cba11-8292-4453-b3bc-b521eeb4eb9a"]]
INSERT INTO "logs" ("log_id", "user_id", "action", "client_id", "brand_id", "product_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "log_id"