app/controllers/products_controller.rb

    def update_product
        @product = Product.find(product_params[:product_id])
        @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "55a5978a-edb8-44b5-8081-60e1cf544fb3"], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."product_id" = $3  [["name", "A. Z. Fell"], ["updated_at", "2024-07-31 21:10:43.283125"], ["product_id", "55a5978a-edb8-44b5-8081-60e1cf544fb3"]]